DataProcessors/ЗагрузкаОстаткаИЦенПоставщика_СД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаОстаткаИЦенПоставщика_СД</Name>
			<Comment>//С.Д. Сеня 31,07,23 +</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Comment>Путь к файлу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервойСтроки</Name>
					<Comment>Номер первой строки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтраницыЗагрузки</Name>
					<Comment>Номер страницы загрузки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиНоменклатура</Name>
					<Comment>Номер колонки номенклатура</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиКоличество</Name>
					<Comment>Номер колонки количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиЦенаСоСкидкой</Name>
					<Comment>Номер колонки цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиЦенаОпт</Name>
					<Comment>Номер колонки цена со скидкой</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоПочте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтаПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтаМенеджера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьЭлектроннойПочты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоговоров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоговоров_СД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиЦенаРекомендована</Name>
					<Comment>Номер колонки цена рекомендована</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабТовары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураНайденоБолееОдного</Name>
							<Comment>Номенклатура найдено более одного</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загружать</Name>
							<Comment>Загружать</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураПоставщика_Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураПоставщика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураПоставщика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСоСкидкой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаОпт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаРекомендована</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСоСкидкойДоЗагрузки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокНовыхНоменклатураПоставщика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураПоставщика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураПоставщика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ИдентификаторыОбработанныхПисем_СД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыОбработанныхПисем_СД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПисьма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗаписьЭлектроннойПочты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НоменклатураПоставщикаОстатки_СД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураПоставщикаОстатки_СД</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаСоСкидкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаОпт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаРекомендована</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НоменклатураПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураПоставщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ШаблоныЗагрузкиОстатковПоставщиков_СД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ШаблоныЗагрузкиОстатковПоставщиков_СД</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УчетнаяЗаписьЭлектроннойПочты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтаМенеджера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПервойСтроки</Name>
					<Comment>Номер первой строки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСтраницыЗагрузки</Name>
					<Comment>Номер страницы загрузки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКолонкиНоменклатура</Name>
					<Comment>Номер колонки номенклатура</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКолонкиКоличество</Name>
					<Comment>Номер колонки количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКолонкиЦенаСоСкидкой</Name>
					<Comment>Номер колонки цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКолонкиЦенаОпт</Name>
					<Comment>Номер колонки цена со скидкой</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтаПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКолонкиЦенаРекомендована</Name>
					<Comment>Номер колонки цена рекомендована</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаДоговоров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоговоров_СД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЗагрузкаОстаткаИЦенПоставщика_СД/Ext/ObjectModule.bsl
Перем ЗапросНоменклатура;
Перем ЗапросНоменклатура_Владелец;

//перем СписокНовыхНоменклатураПоставщика Экспорт;

//Процедура выполняет чтение ексел файла
Процедура ПрочитатьЕкселФайл() Экспорт
	
	Если ПоПочте Тогда 
		
		ИнтернетПочта = Новый ИнтернетПочта;
		Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗаписьЭлектроннойПочты);
		Попытка
			Если Профиль.ИспользоватьSSLIMAP = истина тогда
				ИнтернетПочта.Подключиться(Профиль, ПротоколИнтернетПочты.IMAP);
			Иначе	
				ИнтернетПочта.Подключиться(Профиль, ПротоколИнтернетПочты.POP3);
			КонецЕсли;	
		Исключение
			#Если Клиент Тогда
				ОписаниеОшибкиТекст = ОписаниеОшибки();
				Сообщить(ОписаниеОшибкиТекст);
			#КонецЕсли
			Возврат;
		КонецПопытки;
		ИдентификаторыОбработанныхПисем = ПолучитьИдентификаторыОбработанныхПисем(УчетнаяЗаписьЭлектроннойПочты);
		МассивИдентификаторов = ИнтернетПочта.ПолучитьИдентификаторы(ИдентификаторыОбработанныхПисем);
		//с.д. Рижий -
		Если МассивИдентификаторов.Количество() = 0 Тогда
			ИнтернетПочта.Отключиться();
			Возврат;
		КонецЕсли;
		
		МассивПисем = ИнтернетПочта.Выбрать(Ложь, МассивИдентификаторов);
		
		ИдентификаторыОбработанныхПисемНаборЗаписей = РегистрыСведений.ИдентификаторыОбработанныхПисем_СД.СоздатьНаборЗаписей();
		
		МассивНовыхСообщений = Новый Массив;
		ОбъектСообщения      = Неопределено;
		
		Для каждого МассивПисемЭлемент Из МассивПисем Цикл
			Если не МассивПисемЭлемент.Отправитель.Адрес = ПочтаПоставщика Тогда 
				НоваяЗапись = ИдентификаторыОбработанныхПисемНаборЗаписей.Добавить();
				НоваяЗапись.УчетнаяЗаписьЭлектроннойПочты = УчетнаяЗаписьЭлектроннойПочты;
				НоваяЗапись.Идентификатор                 = МассивПисемЭлемент.Идентификатор[0];
				НоваяЗапись.ДатаПисьма                    = МассивПисемЭлемент.ДатаОтправления;
				НоваяЗапись.Тема                          = МассивПисемЭлемент.Тема;
				Продолжить;
			КонецЕсли;	
			
			Для каждого МассивПисемЭлементВложенияЭлемент Из МассивПисемЭлемент.Вложения Цикл
				ФайлВложения = Новый Файл(МассивПисемЭлементВложенияЭлемент.ИмяФайла);
				ЕстьФайлЕксель = Ложь;
				Если ФайлВложения.Расширение = ".xlsx" или ФайлВложения.Расширение = ".xls" Тогда
					
					ИмяxlsФайла = КаталогВременныхФайлов() + ФайлВложения.Имя;
					Попытка
						
						МассивПисемЭлементВложенияЭлемент.Данные.Записать(ИмяxlsФайла);
						ЕстьФайлЕксель = Истина;
					Исключение
						#Если Клиент Тогда   
							Сообщить(ОписаниеОшибки());
						#КонецЕсли
						Продолжить;
					КонецПопытки;
				КонецЕсли;
				Если ЕстьФайлЕксель Тогда
					ПутьКФайлу_ = ИмяxlsФайла;
					ПрочитатьФайл(ПутьКФайлу_);
				КонецЕсли;	
			КонецЦикла;
			
			//Если НЕ ЕстьIMFX ИЛИ (ОбъектСообщения <> Неопределено И НЕ ОбъектСообщения.ЭтоНовый()) Тогда
			НоваяЗапись = ИдентификаторыОбработанныхПисемНаборЗаписей.Добавить();
			НоваяЗапись.УчетнаяЗаписьЭлектроннойПочты = УчетнаяЗаписьЭлектроннойПочты;
			НоваяЗапись.Идентификатор                 = МассивПисемЭлемент.Идентификатор[0];
			НоваяЗапись.ДатаПисьма                    = МассивПисемЭлемент.ДатаОтправления;
			НоваяЗапись.Тема                          = МассивПисемЭлемент.Тема;
			//КонецЕсли;
			
		КонецЦикла;
		
		ИнтернетПочта.Отключиться();
		
		Если ИдентификаторыОбработанныхПисемНаборЗаписей.Количество() > 0 Тогда
			Попытка
				ИдентификаторыОбработанныхПисемНаборЗаписей.Записать(Ложь);
			Исключение
				#Если Клиент Тогда
					Сообщить(ОписаниеОшибки());
				#КонецЕсли
			КонецПопытки;
		КонецЕсли;
		
		//сначала скачаем файл 
		//Каталог = КаталогВременныхФайлов();//"D:\1С\";
		//ИмяФайла = "Файл_" + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy_HH_MM")+".xls";
		//КопироватьФайл(ПутьКФайлу, Каталог+""+ИмяФайла);	
		//
		//Файл_ = Каталог+""+ИмяФайла;
		//ПутьКФайлу_ = Файл_;
		
	Иначе
		ПутьКФайлу_ = ПутьКФайлу;
		ПрочитатьФайл(ПутьКФайлу_);
	КонецЕсли;	
	
КонецПроцедуры

Процедура прочитатьФайл(ПутьКФайлу_)
	
	//Очищаем таблицу
	ТабТовары.Очистить();
	СписокНовыхНоменклатураПоставщика.Очистить();
	
	//Читаем файл ексел
	Попытка
		Эксель = Новый COMОбъект("Excel.Application"); 
	Исключение
		#Если Клиент Тогда  
			Сообщить("Не удалось создать объект ЕКСЕЛ по причине: " + ОписаниеОшибки()); 
		#КонецЕсли
		Возврат;
	КонецПопытки;
	
	Эксель.DisplayAlerts = 0;//отключение ругательных сообщений
	
	//Открываем файл
	Попытка
		Книга = Эксель.WorkBooks.Open(ПутьКФайлу_);
		//Книга.LockServerFile();
		Лист = Книга.WorkSheets(НомерСтраницыЗагрузки);
	Исключение
		#Если Клиент Тогда
			Сообщить("Не удалось открыть файл: " + ПутьКФайлу_ + " или страницу номер: " + Строка(НомерСтраницыЗагрузки) + " по причине: " + ОписаниеОшибки()); 
		#КонецЕсли

		Если ПоПочте Тогда 
			Попытка
				УдалитьФайлы(ПутьКФайлу_);  				
			Исключение	
			КонецПопытки;
		КонецЕсли;

		Возврат;
	КонецПопытки;
	
	//Пц = номер первой строки
	Пц = НомерПервойСтроки;
		
	//Обрабатываем
	Пока ПрочитатьОднуСтрокуФайла(Лист, ПЦ) Цикл

		//Увеличиваем ПЦ
		Пц = Пц + 1;
		
	КонецЦикла;
	
	//Закрываем ексел файл
	
	Эксель.WorkBooks.Close();
	Эксель.Application.Quit(); 
	Эксель.Quit();
	Эксель = 0;
	
	Если ПоПочте Тогда 
		УдалитьФайлы(ПутьКФайлу_);
	КонецЕсли;
	
КонецПроцедуры	

Процедура прочитатьИОбработатьИОтправить() Экспорт //общая для регламенту 
	
	ЗаполнитьПоШаблону();
	ПрочитатьЕкселФайл();
	ОбработатьТаблицу();
	ОтправитьСписокНовыхНаПочту();
	
КонецПроцедуры	

//Функция читает одну строку и возвращает результат - прочитана она или нет
Функция ПрочитатьОднуСтрокуФайла(Лист, ПЦ)
	
	//Если в колонке не содержится дата, то возвращаем ложь
	//Обрабатываем далее - читаем файл - получаем первую строку и получаем колонку дата
	#Если Клиент Тогда
		Состояние("Обрабатывается строка: " + Строка(ПЦ));
	#КонецЕсли
	//Получаем заполнена ли строка
	НоменклатураПоставщика_Наименование = СокрЛП(Лист.Cells(ПЦ, НомерКолонкиНоменклатура).Value);
	
	//Проверяем заполнено значение или нет
	Если Не ЗначениеЗаполнено(НоменклатураПоставщика_Наименование)  Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	НоменклатураПоставщика_Наименование = "";
	Если НомерКолонкиНоменклатура = 0 Тогда
	Иначе	
		НоменклатураПоставщика_Наименование = СокрЛП(Лист.Cells(ПЦ, НомерКолонкиНоменклатура).Value);
	КонецЕсли;	
		
	ВНаличии = "";
	Если НомерКолонкиКоличество = 0 Тогда
	Иначе	
		ВНаличии = СокрЛП(Лист.Cells(ПЦ, НомерКолонкиКоличество).Value);
	КонецЕсли;
	
	ЦенаСоСкидкой = "";
	Если НомерКолонкиЦенаСоСкидкой = 0 Тогда
	Иначе	
		ЦенаСоСкидкой  = СокрЛП(Лист.Cells(ПЦ, НомерКолонкиЦенаСоСкидкой).Value);
	КонецЕсли;
	
	ЦенаОпт = "";
	Если НомерКолонкиЦенаОпт = 0 Тогда
	Иначе	
		ЦенаОпт  = СокрЛП(Лист.Cells(ПЦ, НомерКолонкиЦенаОпт).Value);
	КонецЕсли;
	
	ЦенаРекомендована = "";
	Если НомерКолонкиЦенаРекомендована = 0 Тогда
	Иначе	
		ЦенаРекомендована  = СокрЛП(Лист.Cells(ПЦ, НомерКолонкиЦенаРекомендована).Value);
	КонецЕсли;
	
	//1. По Наименованию
	НоменклатураНайденоНесколько = Ложь;
	НоменклатураПоставщика =  Справочники.НоменклатураПоставщика.ПустаяСсылка();
	
	Если НоменклатураПоставщика =  Справочники.НоменклатураПоставщика.ПустаяСсылка() Тогда 
		//Ищем номенклатуру по владельцу
		ЗапросНоменклатура_Владелец.УстановитьПараметр("Наименование", НоменклатураПоставщика_Наименование);
		ЗапросНоменклатура_Владелец.УстановитьПараметр("Владелец", Поставщик);
		//Получаем таблицу поиска
		ТаблицаПоиска_Владелец = ЗапросНоменклатура_Владелец.Выполнить().Выгрузить();
		
		//Найдено несколько
		НоменклатураНайденоНесколько = Ложь;
		
		//Обрабатываем
		Если ТаблицаПоиска_Владелец.Количество() = 1 Тогда
			НоменклатураПоставщика = ТаблицаПоиска_Владелец[0].НоменклатураПоставщика;
		ИначеЕсли ТаблицаПоиска_Владелец.Количество() > 1 Тогда
			НоменклатураПоставщика = ТаблицаПоиска_Владелец[0].НоменклатураПоставщика;
			НоменклатураНайденоНесколько = Истина;
			#Если Клиент Тогда   
				Сообщить("В строке номер: " + Пц + " по наименованию: " + НоменклатураПоставщика_Наименование + " найдено несколько позиций Номенклатуры поставщика!", СтатусСообщения.Важное);
			#КонецЕсли
		КонецЕсли;
	КонецЕсли;
	
	Если НоменклатураПоставщика =  Справочники.НоменклатураПоставщика.ПустаяСсылка() Тогда 
		//Ищем номенклатуру
		ЗапросНоменклатура.УстановитьПараметр("Наименование", НоменклатураПоставщика_Наименование);
		//ЗапросНоменклатура.УстановитьПараметр("Владелец", Поставщик);
		//Получаем таблицу поиска
		ТаблицаПоиска = ЗапросНоменклатура.Выполнить().Выгрузить();
		
		
		//Найдено несколько
		НоменклатураНайденоНесколько = Ложь;
		
		//Обрабатываем
		Если ТаблицаПоиска.Количество() = 1 Тогда
			НоменклатураПоставщика = ТаблицаПоиска[0].НоменклатураПоставщика;
		ИначеЕсли ТаблицаПоиска.Количество() > 1 Тогда
			НоменклатураПоставщика = ТаблицаПоиска[0].НоменклатураПоставщика;
			НоменклатураНайденоНесколько = Истина;
			#Если Клиент Тогда   
				Сообщить("В строке номер: " + Пц + " по наименованию: " + НоменклатураПоставщика_Наименование + " найдено несколько позиций Номенклатуры поставщика!", СтатусСообщения.Важное);
			#КонецЕсли
		КонецЕсли;
	КонецЕсли;
	
	//Добавляем строку
	НовСтрока = ТабТовары.Добавить();
	
	//ЗАполняем значения
	НовСтрока.НоменклатураПоставщика_Наименование		= НоменклатураПоставщика_Наименование;
	НовСтрока.НоменклатураПоставщика					= НоменклатураПоставщика;
	//Если не ЗначениеЗаполнено(НовСтрока.Номенклатура) Тогда 
	//	Загр = Ложь;
	//Иначе
		Загр = истина;
	//КонецЕсли;
	НовСтрока.Загружать  					 = Загр;
	НовСтрока.НоменклатураНайденоБолееОдного = НоменклатураНайденоНесколько;

	НовСтрока.Количество                     = ВНаличии;
	НовСтрока.ЦенаСоСкидкой					 = ЦенаСоСкидкой;
	НовСтрока.ЦенаОпт		         		 = ЦенаОпт;
	НовСтрока.ЦенаРекомендована         	 = ЦенаРекомендована;
	
	ЦенаСоСкидкойДоЗагрузки = 0;
	Если ЗначениеЗаполнено(НовСтрока.НоменклатураПоставщика) Тогда 
		отборСтр = новый Структура;
		отборСтр.Вставить("НоменклатураПоставщика", НоменклатураПоставщика);
		
		СрезЦенаЗак = РегистрыСведений.НоменклатураПоставщикаОстатки_СД.СрезПоследних(ТекущаяДата(), отборСтр);
		Если СрезЦенаЗак.Количество() <> 0 Тогда 
			 ЦенаСоСкидкойДоЗагрузки = СрезЦенаЗак[0].ЦенаСоСкидкой;
		КонецЕсли;	
	КонецЕсли;
	НовСтрока.ЦенаСоСкидкойДоЗагрузки          = ЦенаСоСкидкойДоЗагрузки;
	
	Возврат Истина;
	
КонецФункции

//Процедура обрабатывает документы
Процедура ОбработатьТаблицу() Экспорт
	
	//Для начала попробуем создать всю необходимую номенклатуру в строках
	Для Каждого СтрТовар Из ТабТовары Цикл
		
		//Состояние
		#Если Клиент Тогда
			Состояние("Создание Номенклатуры Поставщика - обработка строки: " + СтрТовар.НомерСтроки);
		#КонецЕсли
		//Если стоит признак загружать - то загружаем
		Если Не СтрТовар.Загружать Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрТовар.НоменклатураПоставщика =  Справочники.НоменклатураПоставщика.ПустаяСсылка() Тогда 
			//Ищем номенклатуру
			ЗапросНоменклатура_Владелец.УстановитьПараметр("Наименование", СтрТовар.НоменклатураПоставщика_Наименование);
			ЗапросНоменклатура_Владелец.УстановитьПараметр("Владелец", Поставщик);
			//Получаем таблицу поиска
			ТаблицаПоиска = ЗапросНоменклатура_Владелец.Выполнить().Выгрузить();
			
			Если ТаблицаПоиска.Количество() > 0 Тогда
				СтрТовар.НоменклатураПоставщика = ТаблицаПоиска[0].НоменклатураПоставщика;
			КонецЕсли;
		КонецЕсли;
		
		//Если стоит признак загружать, и нет номенклатуры - создадим её
		Если Не ЗначениеЗаполнено(СтрТовар.НоменклатураПоставщика) или не СтрТовар.НоменклатураПоставщика.Владелец = Поставщик Тогда
			
			//Создадим новую позицию номенклатуры
			НовНом 							= Справочники.НоменклатураПоставщика.СоздатьЭлемент();
			НовНом.Владелец                 = Поставщик;
			//Поля
			НовНом.Наименование 			= СокрЛП(СтрТовар.НоменклатураПоставщика_Наименование);
			НовНом.ВидНоменклатуры			= ВидНоменклатуры;
			НовНом.Новосоздан		    	= Истина;//С.Д. Сеня 11,08,23 +
			
			//Устанавливаем новый код
			НовНом.УстановитьНовыйКод();
			
			Если ЗначениеЗаполнено(СтрТовар.НоменклатураПоставщика) Тогда 
				Если ЗначениеЗаполнено(СтрТовар.НоменклатураПоставщика.Номенклатура) Тогда 
					НовНом.Номенклатура = СтрТовар.НоменклатураПоставщика.Номенклатура;
				иначе 
					НовНом.Новосоздан   = Ложь;  
				КонецЕсли;
			КонецЕсли;	
			
			//обмен данными
			НовНом.ОбменДанными.Загрузка = Истина;
			
			//Пробуем записать
			Попытка
				НовНом.Записать();
			Исключение
				#Если Клиент Тогда
					Сообщить("Обработка строки номер: " + СтрТовар.НомерСтроки + " - не удалось создать Номенклатуру Поставщика!", СтатусСообщения.Важное);
				#КонецЕсли

				Продолжить;
			КонецПопытки;
			
			//Присваиваем в строку
			СтрТовар.НоменклатураПоставщика = НовНом.Ссылка;
			Если не ЗначениеЗаполнено(НовНом.Номенклатура) Тогда 
				новстрСп = СписокНовыхНоменклатураПоставщика.Добавить();	
				новстрСп.НоменклатураПоставщика = НовНом.Ссылка;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрТовар.НоменклатураПоставщика) Тогда 
			Набор_ = РегистрыСведений.НоменклатураПоставщикаОстатки_СД.СоздатьНаборЗаписей();
			Набор_.Отбор.НоменклатураПоставщика.Установить(СтрТовар.НоменклатураПоставщика);
			ПериодУстан = ТекущаяДата();
			Набор_.Отбор.период.Установить(ПериодУстан);
			Набор_.Прочитать();
			Если Набор_.Количество() = 0 Тогда 
				НовНаб = Набор_.Добавить();
				НовНаб.НоменклатураПоставщика = СтрТовар.НоменклатураПоставщика;
				НовНаб.Период = ПериодУстан;
			Иначе
				НовНаб = Набор_[0];
			КонецЕсли;	
			НовНаб.Количество 		 = СтрТовар.Количество;
			НовНаб.ЦенаСоСкидкой 	 = СтрТовар.ЦенаСоСкидкой;
			НовНаб.ЦенаОпт           = СтрТовар.ЦенаОпт;
			НовНаб.ЦенаРекомендована = СтрТовар.ЦенаРекомендована;
			Набор_.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьИдентификаторыОбработанныхПисем(УчетнаяЗаписьЭлектроннойПочты) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Идентификатор
		|ИЗ
		|	РегистрСведений.ИдентификаторыОбработанныхПисем_СД
		|ГДЕ
		|	УчетнаяЗаписьЭлектроннойПочты = &УчетнаяЗаписьЭлектроннойПочты");
	Запрос.УстановитьПараметр("УчетнаяЗаписьЭлектроннойПочты", УчетнаяЗаписьЭлектроннойПочты);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Идентификатор");
	
КонецФункции // ПолучитьИдентификаторыОбработанныхПисем()
//С.Д. Сеня 30,07,23 -

Процедура ОтправитьСписокНовыхНаПочту() Экспорт 
	Если ЗначениеЗаполнено(УчетнаяЗаписьЭлектроннойПочты) Тогда  	 
		Если СписокНовыхНоменклатураПоставщика.Количество() = 0 Тогда 
			Возврат;
		КонецЕсли;	
		
		ИнтернетПочта = Новый ИнтернетПочта;
		Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗаписьЭлектроннойПочты);
		
		Сообщение = Новый ИнтернетПочтовоеСообщение;
		Сообщение.ИмяОтправителя = Профиль.Пользователь;
		Сообщение.Отправитель = Профиль.Пользователь;
		Сообщение.Тема = "Перелік нових товарів постачальника - "+Поставщик.Наименование+". " + Формат(ТекущаяДата(),"ДФ='dd.MM.yyyy HH:mm:ss'" );
		//С.Д. Сеня 18,08,23 Было + 		Сообщение.Получатели.Добавить(ПочтаМенеджера);  
		ПочтаМенеджера_ = СокрЛП(ПочтаМенеджера);
		массивПолучателей = РазложитьСтрокуНаПодстроки(ПочтаМенеджера_, ";");
		Для Каждого сТРм ИЗ массивПолучателей Цикл 
			Сообщение.Получатели.Добавить(сТРм);  
		КонецЦикла;
		
		текстПисьма = "";
		НомерПП = 1;
		для Каждого СтрНоНом из СписокНовыхНоменклатураПоставщика Цикл 
			текстПисьма = текстПисьма + НомерПП + ". " + Символы.Таб + СтрНоНом.НоменклатураПоставщика.Наименование + Символы.ПС;
			НомерПП = НомерПП + 1;
		КонецЦикла;	
		Сообщение.Тексты.Добавить(текстПисьма);
		
		Попытка
			//Состояние("Отправка почтового сообщения...");
			ИнтернетПочта.Подключиться(Профиль);
			ИнтернетПочта.Послать(Сообщение);
			#Если Клиент Тогда   			
				Предупреждение("Сообщения успешно отправлены!");
			#КонецЕсли
		Исключение
			#Если Клиент Тогда   			
				Сообщить("Ошибка ...",СтатусСообщения.ОченьВажное);
				Сообщить(""+ОписаниеОшибки());
			#КонецЕсли
		КонецПопытки;
		ИнтернетПочта.Отключиться();
	КонецЕсли;
КонецПроцедуры	

//С.Д. Сеня 10,08,23 +
Процедура ЗаполнитьПоШаблону() Экспорт 
	
	ПоПочте = Истина;
	
	Если НЕ ЗначениеЗаполнено(ГруппаДоговоров) или не ЗначениеЗаполнено(Поставщик)Тогда
		#Если Клиент Тогда
			Предупреждение("Укажите Поставщика и Группа договоров!");
		#КонецЕсли
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Поставщик) и ЗначениеЗаполнено(ГруппаДоговоров) Тогда 
		отбСр = новый Структура("Поставщик", Поставщик);
		отбСр.Вставить("ГруппаДоговоров", ГруппаДоговоров);
		ШаблонСрез = РегистрыСведений.ШаблоныЗагрузкиОстатковПоставщиков_СД.СрезПоследних(ТекущаяДата(), отбСр);
		Если не ШаблонСрез.Количество() = 0 Тогда 
			
			ЭтотОбъект.УчетнаяЗаписьЭлектроннойПочты = ШаблонСрез[0].УчетнаяЗаписьЭлектроннойПочты;
			ЭтотОбъект.ПочтаМенеджера 				 = ШаблонСрез[0].ПочтаМенеджера;
			ЭтотОбъект.НомерПервойСтроки 			 = ШаблонСрез[0].НомерПервойСтроки;
			ЭтотОбъект.НомерСтраницыЗагрузки 		 = ШаблонСрез[0].НомерСтраницыЗагрузки;
			ЭтотОбъект.НомерКолонкиНоменклатура 	 = ШаблонСрез[0].НомерКолонкиНоменклатура;
			ЭтотОбъект.НомерКолонкиКоличество 		 = ШаблонСрез[0].НомерКолонкиКоличество;
			ЭтотОбъект.НомерКолонкиЦенаСоСкидкой	 = ШаблонСрез[0].НомерКолонкиЦенаСоСкидкой;
			ЭтотОбъект.НомерКолонкиЦенаОпт      	 = ШаблонСрез[0].НомерКолонкиЦенаОпт;
			ЭтотОбъект.НомерКолонкиЦенаРекомендована = ШаблонСрез[0].НомерКолонкиЦенаРекомендована;
			ЭтотОбъект.ВидНоменклатуры				 = ШаблонСрез[0].ВидНоменклатуры;
			ЭтотОбъект.ПочтаПоставщика 				 = ШаблонСрез[0].ПочтаПоставщика;
			
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры	
//С.Д. Сеня 10,08,23 -

Функция РазложитьСтрокуНаПодстроки(ВходящаяСтрока, Разделитель)
						   
	МассивСтрок = Новый Массив();
	ВходящаяСтрока = СтрЗаменить(ВходящаяСтрока, Разделитель, Символы.ПС);
	
	Для ИндексСтроки = 1 По СтрЧислоСтрок(ВходящаяСтрока) Цикл
		Подстрока = СтрПолучитьСтроку(ВходящаяСтрока, ИндексСтроки);
		МассивСтрок.Добавить(СокрЛП(Подстрока));
	КонецЦикла;
	
	Возврат МассивСтрок;

КонецФункции 

//Текст запроса номенклатураэ
ЗапросНоменклатура = Новый Запрос;

//Текст запроса
ЗапросНоменклатура.Текст = "ВЫБРАТЬ
                           |	ВложенныйЗапрос.Номенклатура КАК НоменклатураПоставщика
                           |ИЗ
                           |	(ВЫБРАТЬ
                           |		НоменклатураПоставщика.Ссылка КАК Номенклатура
                           |	ИЗ
                           |		Справочник.НоменклатураПоставщика КАК НоменклатураПоставщика
                           |	ГДЕ
                           |		НоменклатураПоставщика.Наименование = &Наименование
                           //|		И НоменклатураПоставщика.Владелец = &Владелец
                           |		И НоменклатураПоставщика.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
                           |
                           |СГРУППИРОВАТЬ ПО
                           |	ВложенныйЗапрос.Номенклатура";
						   
//Текст запроса номенклатураэ
ЗапросНоменклатура_Владелец = Новый Запрос;

//Текст запроса
ЗапросНоменклатура_Владелец.Текст = "ВЫБРАТЬ
                           |	ВложенныйЗапрос.Номенклатура КАК НоменклатураПоставщика
                           |ИЗ
                           |	(ВЫБРАТЬ
                           |		НоменклатураПоставщика.Ссылка КАК Номенклатура
                           |	ИЗ
                           |		Справочник.НоменклатураПоставщика КАК НоменклатураПоставщика
                           |	ГДЕ
                           |		НоменклатураПоставщика.Наименование = &Наименование
                           |		И НоменклатураПоставщика.Владелец = &Владелец
                           |		И НоменклатураПоставщика.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
                           |
                           |СГРУППИРОВАТЬ ПО
                           |	ВложенныйЗапрос.Номенклатура";
